      * Test structure with 0 elements
           05 '*-'TEST-STRUCT-0.
             10 '*-'TEST-STRUCT-0-FLAGS PIC 9 BINARY.
                88 VALUE-ABSENT VALUE 0.
                88 VALUE-PRESENT VALUE 1.
                88 VALUE-UNREPRESENTABLE VALUE 2.

